#include "stdafx.h"
#include <string>
#include<iostream>
using namespace std;

extern void getsym();
extern string sym;
extern int cx;

int err=0;

string serror[100] =
{
	"0.请检查标识符是否定义",
	"1.请检查是否标识符重复定义",
	"2.请检查是否缺少标识符",
	"3.程序必须以program开始",
	"4.请检查是否缺少’)’",
	"5.请检查是否缺少’:’，在说明类型时必须有此冒号",
	"6.非法符号，编译将跳读该符号和后面的某些符号",
	"7.形式参数表中，形参说明应该以标识符或var开头",
	"8.请检查是否缺少of",
	"9.请检查是否缺少'('",
	"10.类型定义必须以标识符或array开头",
	"11.请检查是否缺少'['",
	"12.请检查是否缺少']'",
	"13.请检查是否缺少'.'",
	"14.请检查是否缺少';'",
	"15.函数结果必须是integer, real或char类型",
	"16.请检查是否缺少'='，':='只能在赋值语句里使用，而不能在说明中使用",
	"17.在if , while或until后面的表达式必须是boolean型",
	"18.在for后面的循环变量只能是interger或char型",
	"19.for语句中初值或终值表达式必须与循环变量类型相同",
	"20.程序头部未包含参数“output”或“input”",
	"21.数太大，最多为14位数字",
	"22.程序结尾是'.'，请检查相应的begin和end",
	"23.case后面的表达式必须是integer或char (对于后者，建议用if语句)",
	"24.非法字符",
	"25.在常量定义中，等号后面必须是常数或常量标识符",
	"26.下标表达式类型必须与数组说明中的下标类型相同",
	"27.数组说明中，下界不能超过上界，同时它们的类型必须相同(同为整数、逻辑值或字符)。实数上、下界是非法的",
	"28.没有这样的数组",
	"29.请检查是否缺少类型标识符",
	"30.该类型未定义(不允许递归定义类型)",
	"31.没有这样的记录",
	"32.not,and或or的操作数必须是boolean型",
	"33.该算术表达式的类型不合法。注意，数组整体不能作为算术或逻辑运算的操作数",
	"34.div和mod运算的操作数必须是integer型",
	"35.相比较的对象类型必须相同，除非它们一个是整型，另一个是实型。数组只能比较它们的元素",
	"36.实参和对应形参类型应相同，除非形参为实型的值形参而实参为整型",
	"37.应是变量",
	"38.字符串至少有一个字符",
	"39.实参个数与形参个数不等",
	"40.小数点后没有数字",
	"41.read或write的参数类型不正确",
	"42.该表达式应为实型",
	"43.write语句的域宽应为整型",
	"44.表达式中不能出现类型或过程标识符",
	"45.应是变量或过程 / 函数标识符",
	"46.在赋值语句中被赋值变量应与表达式类型相同，除非前者为实型而后者为整型",
	"47.case语句中标号必须是与case子句表达式类型相同的常量",
	"48.该标准函数的变元表达式类型不正确",
	"49.内存溢出",
	"50.请检查是否缺少常量",
	"51.请检查是否缺少“:=”",
	"52.请检查if语句中是否缺少then",
	"53.请检查是否缺少until",
	"54.请检查for语句中是否缺少do",
	"55.请检查for语句中是否缺少to或downto",
	"56.请检查是否缺少begin",
	"57.请检查是否缺少end",
	"58.因子必须以标识符、常量、或')'开始",
	"59.请检查是否缺少 “'” ",
	"60.程序要以“.”结尾",
	"61.运算中不允许直接对字符进行操作",
	"62.请检查常量声明后是否是var、produce、function、begin",
	"63.变量声明应该以“;”结束",
	"64.过程和函数声明中括号内参数不能为空"
};

string	msg[10] =
{
	"",
	"1.identifier",
	"2.procedure",
	"3.reals",
	"4.arrays",
	"5.levels",
	"6.code",
	"7.strings"
};


void skip(int n)
{
	while (sym != "semicolon")
		getsym();
	cout << "skip: " << serror[n] << " at " << cx << endl;
	getsym();
}

void error(int n)
{
	cout << "error: " << serror[n] <<" at "<<cx<< endl;
	err += 1;
}

void fatal(int n)
{
	cout << "fatal:" << msg[n] <<" at "<<cx<< endl;
}

void testsemicolon()
{
	if (sym == "semicolon")
		getsym();
	else
	{
		error(14);
		if (sym == "camma" || sym == "colon")
			getsym();
	}
	//test
}


/*0.该标识符未定义
1.标识符重复定义
2.应是标识符
//3.程序必须以program开始
4.应是’)’
5.应是’:’，在说明类型时必须有此冒号
6.非法符号，编译将跳读该符号和后面的某些符号
7.形式参数表中，形参说明应该以标识符或var开头
8.应是of
9.应是'('
10.类型定义必须以标识符或array开头
11.应是'['
12.应是']'
//13.应是'..'
14.应是';'’
15.函数结果必须是integer, real或char类型
16.应是'='，':='只能在赋值语句里使用，而不能在说明中使用
//17.在if , while或until后面的表达式必须是boolean型
18.在for后面的循环变量只能是interger或char型
19.for语句中初值或终值表达式必须与循环变量类型相同
20.程序头部未包含参数“output”或“input"
21.数太大，最多为14位数字
22.程序结尾是'.'，请检查相应的begin和end
23.case后面的表达式必须是integer或char (对于后者，建议用if语句)
24.非法字符
25.在常量定义中，等号后面必须是常数或常量标识符
26.下标表达式类型必须与数组说明中的下标类型相同
27.数组说明中，下界不能超过上界，同时它们的类型必须相同(同为整数、逻辑值或字符)。实数上、下界是非法的
28.没有这样的数组
29.应是类型标识符
30.该类型未定义(不允许递归定义类型)
31.没有这样的记录
//32.not,and或or的操作数必须是boolean型
33.该算术表达式的类型不合法。注意，数组整体不能作为算术或逻辑运算的操作数
//34.div和mod运算的操作数必须是integer型
35.相比较的对象类型必须相同，除非它们一个是整型，另一个是实型。数组只能比
较它们的元素
36.实参和对应形参类型应相同，除非形参为实型的值形参而实参为整型
37.应是变量
38.字符串至少有一个字符
39.实参个数与形参个数不等
40.小数点后没有数字
41.read或write的参数类型不正确
42.该表达式应为实型
//43.write语句的域宽应为整型
44.表达式中不能出现类型或过程标识符
45.应是变量或过程 / 函数标识符
46.在赋值语句中被赋值变量应与表达式类型相同，除非前者为实型而后者为整型
//47.case语句中标号必须是与case子句表达式类型相同的常量
48.该标准函数的变元表达式类型不正确
49.内存溢出
50.应是常量
51.应是":="
52.应是then
//53.应是until
54.应是do
55.应是to或downto
56.应是begin
57.应是end
58.因子必须以标识符、常量、或')'开始
*/